## SQL at Scale with Spark SQL

Welcome to the SQL mini project. For this project, you will use the Domino Data Lab Platform and work through a series of exercises using Spark SQL. The dataset size may not be too big but the intent here is to familiarize yourself with the Spark SQL interface which scales easily to huge datasets, without you having to worry about changing your SQL queries. 

The data you need is present in the mini-project folder in the form of three CSV files. You need to make sure that these datasets are uploaded and present in the same directory as this notebook file, since we will be importing these files in Spark and create the following tables under the __`country_club`__ database using Spark SQL.

1. The __`bookings`__ table,
2. The __`facilities`__ table, and
3. The __`members`__ table.

You will be uploading these datasets shortly into Spark to understand how to create a database within minutes! Once the database and the tables are populated, you will be focusing on the mini-project questions.

In the mini project, you'll be asked a series of questions. You can solve them using the Domino platform, but for the final deliverable, please download this notebook as an IPython notebook (__`File -> Export -> IPython Notebook`__) and upload it to your GitHub.

# Checking Existence of Spark Environment Variables

Make sure your notebook is loaded using a PySpark Workspace. If you open up a regular Jupyter workspace the following variables might not exist

In [1]:
spark

In [2]:
sqlContext

### Run the following if you failed to open a notebook in the PySpark Workspace

This will work assuming you are using Spark in the cloud on domino or you might need to configure with your own spark instance if you are working offline

In [3]:
if 'sc' not in locals():
    from pyspark.context import SparkContext
    from pyspark.sql.context import SQLContext
    from pyspark.sql.session import SparkSession
    
    sc = SparkContext()
    sqlContext = SQLContext(sc)
    spark = SparkSession(sc)

# Create a utility function to run SQL commands

Instead of typing the same python functions repeatedly, we build a small function where you can just pass your query to get results.

- Remember we are using Spark SQL in PySpark
- We can't run multiple SQL statements in one go (no semi-colon ';' separated SQL statements)
- We can run multi-line SQL queries (but still has to be a single statement)

In [4]:
def run_sql(statement):
    try:
        result = sqlContext.sql(statement)
    except Exception as e:
        print(e.desc, '\n', e.stackTrace)
        return
    return result

# Creating the Database

We will first create our database in which we will be creating our three tables of interest

In [5]:
run_sql('drop database if exists country_club cascade')
run_sql('create database country_club')
dbs = run_sql('show databases')
dbs.toPandas()

   databaseName
0  country_club
1       default

# Creating the Tables

In this section, we will be creating the three tables of interest and populate them with the data from the CSV files already available to you.

To get started, first make sure you have already uploaded the three CSV files and they are present in the same directory as the notebook.

Once you have done this, please remember to execute the following code to build the dataframes which will be saved as tables in our database

In [6]:
# File location and type
file_location_bookings = "./Bookings.csv"
file_location_facilities = "./Facilities.csv"
file_location_members = "./Members.csv"

file_type = "csv"

# CSV options
infer_schema = "true"
first_row_is_header = "true"
delimiter = ","

# The applied options are for CSV files. For other file types, these will be ignored.
bookings_df = (spark.read.format(file_type) 
                    .option("inferSchema", infer_schema) 
                    .option("header", first_row_is_header) 
                    .option("sep", delimiter) 
                    .load(file_location_bookings))

facilities_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_facilities))

members_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_members))

### Viewing the dataframe schemas

We can take a look at the schemas of our potential tables to be written to our database soon

In [7]:
print('Bookings Schema')
bookings_df.printSchema()
print('Facilities Schema')
facilities_df.printSchema()
print('Members Schema')
members_df.printSchema()

Bookings Schema
root
 |-- bookid: integer (nullable = true)
 |-- facid: integer (nullable = true)
 |-- memid: integer (nullable = true)
 |-- starttime: timestamp (nullable = true)
 |-- slots: integer (nullable = true)

Facilities Schema
root
 |-- facid: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- membercost: double (nullable = true)
 |-- guestcost: double (nullable = true)
 |-- initialoutlay: integer (nullable = true)
 |-- monthlymaintenance: integer (nullable = true)

Members Schema
root
 |-- memid: integer (nullable = true)
 |-- surname: string (nullable = true)
 |-- firstname: string (nullable = true)
 |-- address: string (nullable = true)
 |-- zipcode: integer (nullable = true)
 |-- telephone: string (nullable = true)
 |-- recommendedby: integer (nullable = true)
 |-- joindate: timestamp (nullable = true)

# Create permanent tables
We will be creating three permanent tables here in our __`country_club`__ database as we discussed previously with the following code

In [8]:
permanent_table_name_bookings = "country_club.Bookings"
bookings_df.write.format("parquet").saveAsTable(permanent_table_name_bookings)

permanent_table_name_facilities = "country_club.Facilities"
facilities_df.write.format("parquet").saveAsTable(permanent_table_name_facilities)

permanent_table_name_members = "country_club.Members"
members_df.write.format("parquet").saveAsTable(permanent_table_name_members)

### Refresh tables and check them

In [9]:
run_sql('use country_club')
run_sql('REFRESH table bookings')
run_sql('REFRESH table facilities')
run_sql('REFRESH table members')
tbls = run_sql('show tables')
tbls.toPandas()

       database   tableName  isTemporary
0  country_club    bookings        False
1  country_club  facilities        False
2  country_club     members        False

# Test a sample SQL query

__Note:__ You can use multi-line SQL queries (but still a single statement) as follows

In [10]:
result = run_sql('''
                    SELECT * 
                    FROM bookings 
                    LIMIT 3
                 ''')
result.toPandas()

   bookid  facid  memid           starttime  slots
0       0      3      1 2012-07-03 11:00:00      2
1       1      4      1 2012-07-03 08:00:00      2
2       2      6      0 2012-07-03 18:00:00      2

# Your Turn: Solve the following questions with Spark SQL

- Make use of the `run_sql(...)` function as seen in the previous example
- You can write multi-line SQL queries but it has to be a single statement (no use of semi-colons ';')
- Make use of the `toPandas()` function as depicted in the previous example to display the query results

#### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [11]:
result = run_sql('''
                   SELECT *
                   FROM facilities
                   WHERE membercost > 0
                 ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,4,Massage Room 1,9.9,80.0,4000,3000
3,5,Massage Room 2,9.9,80.0,4000,3000
4,6,Squash Court,3.5,17.5,5000,80

####  Q2: How many facilities do not charge a fee to members?

In [12]:
result = run_sql('''
                   SELECT count(*)
                   FROM facilities
                   WHERE membercost = 0
                 ''')
result.toPandas()

   count(1)
0         4

#### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? 
#### Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [13]:
result = run_sql('''
                   SELECT *
                   FROM facilities
                   WHERE membercost > 0 and membercost < 0.2 * monthlymaintenance
                ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,4,Massage Room 1,9.9,80.0,4000,3000
3,5,Massage Room 2,9.9,80.0,4000,3000
4,6,Squash Court,3.5,17.5,5000,80

#### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [14]:
result = run_sql('''
                   SELECT * 
                   FROM facilities
                   WHERE facid in (1,5)
                ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

#### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? 
#### Return the name and monthly maintenance of the facilities in question.

In [15]:
result = run_sql('''
                   SELECT *, (CASE WHEN monthlymaintenance > 100
                   THEN 'expensive'
                   ELSE 'cheap'
                   END) as label
                   FROM facilities
                 ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance,label
0,0,Tennis Court 1,5.0,25.0,10000,200,expensive
1,1,Tennis Court 2,5.0,25.0,8000,200,expensive
2,2,Badminton Court,0.0,15.5,4000,50,cheap
3,3,Table Tennis,0.0,5.0,320,10,cheap
4,4,Massage Room 1,9.9,80.0,4000,3000,expensive
5,5,Massage Room 2,9.9,80.0,4000,3000,expensive
6,6,Squash Court,3.5,17.5,5000,80,cheap
7,7,Snooker Table,0.0,5.0,450,15,cheap
8,8,Pool Table,0.0,5.0,400,15,cheap

#### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [21]:
result = run_sql('''
                    SELECT *
                    FROM members
                    ORDER BY joindate DESC
                 ''')
result.toPandas().iloc[[0]]

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,37,Smith,Darren,"3 Funktown, Denzington, Boston",66796,(822) 577-3541,NaN,2012-09-26 18:08:45

####  Q7: How can you produce a list of all members who have used a tennis court?
- Include in your output the name of the court, and the name of the member formatted as a single column. 
- Ensure no duplicate data
- Also order by the member name.

In [33]:
result = run_sql('''
                    SELECT DISTINCT f.name AS facility, 
                    (CASE WHEN b.memid = 0
                    THEN 'Guest'
                    ELSE CONCAT(m.firstname, ' ', m.surname)
                    END) AS member
                    FROM bookings b
                    INNER JOIN facilities f
                    ON b.facid = f.facid
                    INNER JOIN members m
                    ON b.memid = m.memid
                    WHERE f.facid IN (0,1)
                    ORDER BY member, facility
                 ''')
result.toPandas()

          facility             member
0   Tennis Court 1         Anne Baker
1   Tennis Court 2         Anne Baker
2   Tennis Court 1       Burton Tracy
3   Tennis Court 2       Burton Tracy
4   Tennis Court 1       Charles Owen
5   Tennis Court 2       Charles Owen
6   Tennis Court 2       Darren Smith
7   Tennis Court 1      David Farrell
8   Tennis Court 2      David Farrell
9   Tennis Court 1        David Jones
10  Tennis Court 2        David Jones
11  Tennis Court 1       David Pinker
12  Tennis Court 1      Douglas Jones
13  Tennis Court 1      Erica Crumpet
14  Tennis Court 1     Florence Bader
15  Tennis Court 2     Florence Bader
16  Tennis Court 1     Gerald Butters
17  Tennis Court 2     Gerald Butters
18  Tennis Court 1              Guest
19  Tennis Court 2              Guest
20  Tennis Court 2   Henrietta Rumney
21  Tennis Court 1         Jack Smith
22  Tennis Court 2         Jack Smith
23  Tennis Court 1    Janice Joplette
24  Tennis Court 2    Janice Joplette
25  Tennis Court 1     Jemima Farrell
26  Tennis Court 2     Jemima Farrell
27  Tennis Court 1        Joan Coplin
28  Tennis Court 1          John Hunt
29  Tennis Court 2          John Hunt
30  Tennis Court 1    Matthew Genting
31  Tennis Court 2  Millicent Purview
32  Tennis Court 1         Nancy Dare
33  Tennis Court 2         Nancy Dare
34  Tennis Court 1    Ponder Stibbons
35  Tennis Court 2    Ponder Stibbons
36  Tennis Court 1   Ramnaresh Sarwin
37  Tennis Court 2   Ramnaresh Sarwin
38  Tennis Court 1         Tim Boothe
39  Tennis Court 2         Tim Boothe
40  Tennis Court 1         Tim Rownam
41  Tennis Court 2         Tim Rownam
42  Tennis Court 1      Timothy Baker
43  Tennis Court 2      Timothy Baker
44  Tennis Court 1        Tracy Smith
45  Tennis Court 2        Tracy Smith

#### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? 

- Remember that guests have different costs to members (the listed costs are per half-hour 'slot')
- The guest user's ID is always 0. 

#### Include in your output the name of the facility, the name of the member formatted as a single column, and the cost.

- Order by descending cost, and do not use any subqueries.

In [34]:
result = run_sql('''
                   SELECT *
                   FROM bookings
                 ''')
result.toPandas()

      bookid  facid  memid           starttime  slots
0          0      3      1 2012-07-03 11:00:00      2
1          1      4      1 2012-07-03 08:00:00      2
2          2      6      0 2012-07-03 18:00:00      2
3          3      7      1 2012-07-03 19:00:00      2
4          4      8      1 2012-07-03 10:00:00      1
5          5      8      1 2012-07-03 15:00:00      1
6          6      0      2 2012-07-04 09:00:00      3
7          7      0      2 2012-07-04 15:00:00      3
8          8      4      3 2012-07-04 13:30:00      2
9          9      4      0 2012-07-04 15:00:00      2
10        10      4      0 2012-07-04 17:30:00      2
11        11      6      0 2012-07-04 12:30:00      2
12        12      6      0 2012-07-04 14:00:00      2
13        13      6      1 2012-07-04 15:30:00      2
14        14      7      2 2012-07-04 14:00:00      2
15        15      8      2 2012-07-04 12:00:00      1
16        16      8      3 2012-07-04 18:00:00      1
17        17      1      0 2012-07-05 17:30:00      3
18        18      2      1 2012-07-05 09:30:00      3
19        19      3      3 2012-07-05 09:00:00      2
20        20      3      1 2012-07-05 19:00:00      2
21        21      4      3 2012-07-05 18:30:00      2
22        22      6      0 2012-07-05 13:00:00      2
23        23      6      1 2012-07-05 14:30:00      2
24        24      7      2 2012-07-05 18:30:00      2
25        25      8      3 2012-07-05 12:30:00      1
26        26      0      0 2012-07-06 08:00:00      3
27        27      0      0 2012-07-06 14:00:00      3
28        28      0      2 2012-07-06 15:30:00      3
29        29      2      1 2012-07-06 17:00:00      3
...      ...    ...    ...                 ...    ...
4013    4013      6      0 2012-09-30 11:00:00      2
4014    4014      6      0 2012-09-30 12:30:00      2
4015    4015      6     12 2012-09-30 14:00:00      2
4016    4016      6      0 2012-09-30 15:30:00      2
4017    4017      6     35 2012-09-30 16:30:00      2
4018    4018      6      0 2012-09-30 17:30:00      2
4019    4019      6      0 2012-09-30 19:00:00      2
4020    4020      7     27 2012-09-30 08:30:00      2
4021    4021      7     33 2012-09-30 09:30:00      2
4022    4022      7     33 2012-09-30 11:00:00      2
4023    4023      7      5 2012-09-30 14:30:00      2
4024    4024      7     15 2012-09-30 16:30:00      2
4025    4025      7     24 2012-09-30 17:30:00      2
4026    4026      7      5 2012-09-30 19:00:00      2
4027    4027      8     16 2012-09-30 08:00:00      1
4028    4028      8     21 2012-09-30 08:30:00      2
4029    4029      8      3 2012-09-30 10:30:00      1
4030    4030      8     16 2012-09-30 11:00:00      1
4031    4031      8      3 2012-09-30 11:30:00      1
4032    4032      8     17 2012-09-30 12:00:00      1
4033    4033      8     21 2012-09-30 12:30:00      1
4034    4034      8      3 2012-09-30 13:00:00      1
4035    4035      8     29 2012-09-30 13:30:00      1
4036    4036      8     28 2012-09-30 14:30:00      1
4037    4037      8     29 2012-09-30 15:30:00      1
4038    4038      8     29 2012-09-30 16:30:00      2
4039    4039      8     29 2012-09-30 18:00:00      1
4040    4040      8     21 2012-09-30 18:30:00      1
4041    4041      8     16 2012-09-30 19:00:00      1
4042    4042      8     29 2012-09-30 19:30:00      1

[4043 rows x 5 columns]

In [45]:
result = run_sql('''
                   SELECT DISTINCT f.name AS facility, 
                    (CASE WHEN b.memid = 0
                    THEN 'Guest'
                    ELSE CONCAT(m.firstname, ' ', m.surname)
                    END) AS member,
                    (CASE WHEN b.memid != 0
                    THEN f.membercost
                    ELSE f.guestcost
                    END) AS cost
                    FROM bookings b
                    INNER JOIN facilities f
                    ON b.facid = f.facid
                    INNER JOIN members m
                    ON b.memid = m.memid
                    WHERE date_format(b.starttime, 'yyyy-MM-dd') = '2012-09-14'AND
                    (CASE WHEN b.memid != 0
                    THEN f.membercost > 30
                    ELSE f.guestcost > 30
                    END)
                    ORDER BY cost DESC, member, facility
                 ''')
result.toPandas()

         facility member  cost
0  Massage Room 1  Guest  80.0
1  Massage Room 2  Guest  80.0

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [56]:
result = run_sql('''
                    SELECT DISTINCT f.name AS facility, 
                    (CASE WHEN b.memid = 0
                    THEN 'Guest'
                    ELSE CONCAT(m.firstname, ' ', m.surname)
                    END) AS member,
                    (CASE WHEN b.memid != 0
                    THEN f.membercost
                    ELSE f.guestcost
                    END) AS cost
                    FROM bookings AS b,
                    (SELECT * FROM facilities
                    WHERE membercost > 30 OR guestcost > 30
                    ) AS f,
                    (SELECT * FROM members) AS m
                    WHERE 
                    b.facid = f.facid AND
                    m.memid = b.memid AND
                    date_format(b.starttime, 'yyyy-MM-dd') = '2012-09-14'
                    HAVING cost > 30
                    ORDER BY cost DESC, member, facility
                 ''')
result.toPandas()

         facility member  cost
0  Massage Room 1  Guest  80.0
1  Massage Room 2  Guest  80.0

#### Q10: Produce a list of facilities with a total revenue less than 1000.
- The output should have facility name and total revenue, sorted by revenue. 
- Remember that there's a different cost for guests and members!

In [67]:
result = run_sql('''
                    SELECT f.name AS facility, r.revenue AS revenue
                    FROM facilities f
                    INNER JOIN
                    (SELECT b.facid, SUM(membercost) + SUM(guestcost) AS revenue
                    FROM bookings b
                    INNER JOIN facilities f
                    ON b.facid = f.facid
                    GROUP BY b.facid) AS r
                    USING(facid)
                    WHERE revenue < 1000
                    ORDER BY revenue
                 ''')
result.toPandas()

Empty DataFrame
Columns: [facility, revenue]
Index: []